app/Controllers/Admin/Usuarios.php

    public function index()
    {
        $data = [
            'titulo' => 'Listando os usuários',
            'usuarios' => $usuario = $this->usuarioModel->findAll()
---
SELECT *
FROM `usuarios`

    private function buscaUsuarioOu404(int $id = null){
        if(!$id || !$usuario = $this->usuarioModel->where('id', $id)->first()){
---
SELECT *
FROM `usuarios`
WHERE `id` = 1
 LIMIT 1